// This file contains placeholder data that you'll be replacing with real data in the Data Fetching chapter:
// https://nextjs.org/learn/dashboard-app/fetching-data

const reviews = [
  {
    "id": 1,
		"text": "<h1>Отзыв 1</h1><p>Полученный с api</p><p>HTML</p><p>Но всё же должен выглядить  красиво, на сколько возможно, конечно</p><p>Но всё же должен выглядить  красиво, на сколько возможно, конечно</p><p>Но всё же должен выглядить  красиво, на сколько возможно, конечно</p><p>Но всё же должен выглядить  красиво, на сколько возможно, конечно</p>"
  },
  {
    "id": 2,
		"text": "<h1>Отзыв 2</h1><p>Полученный с api</p><p>HTML</p><p>Но всё же должен выглядить  красиво, на сколько возможно, конечно</p><p>Но всё же должен выглядить  красиво, на сколько возможно, конечно</p><p><script>alert(1)</script></p>"
  }
]

const cartItems = {
  items:[
    {
      name:"товар 1",
      quantity: 3,
      price: 3645
    },
    {
      name:"товаррр 2",
      quantity: 44,
      price: 53460
    }
  ]
};

const products = [
  {
    id: 1,
    image_url: "/products/chimp.png",
    title:"товар 1 товар 1 товар 1 товар 1",
    description:"Описание 1 Описание 1 Описание 1 Описание 1 Описание 1 Описание 1 Описание 1 Описание 1 Описание 1 Описание 1 Описание 1 Описание 1 Описание 1 Описание 1 Описание 1 Описание 1 Описание 1 Описание 1 Описание 1 Описание 1 Описание 1 Описание 1 ",
    price: 1215,
  },
  {
    id: 2,
    image_url: "/products/chimp.png",
    title:"товар 2",
    description:"Описание 2 Описание 2 Описание 2 Описание 2 Описание 2 Описание 2 Описание 2 Описание 2 Описание 2",
    price: 1215,
  },
  {
    id: 3,
    image_url: "/products/chimp.png",
    title:"товар 3",
    description:"Описание описание описание описание описание. ауццау, описание  fe описание. fefe.ауц ау цуацау ццау цуа ацу ацу ауцацууцаауц ауц",
    price: 1215,
  },
  {
    id: 4,
    image_url: "/products/chimp.png",
    title:"товар 4",
    description:"Описание описание описание описание описание. ауццау, описание  fe описание. fefe.ауц ау цуацау ццау цуа ацу ацу ауцацууцаауц ауц",
    price: 1215,
  },
  {
    id: 5,
    image_url: "/products/chimp.png",
    title:"товар 5",
    description:"Описание описание описание описание описание. ауццау, описание  fe описание. fefe.ауц ау цуацау ццау цуа ацу ацу ауцацууцаауц ауц",
    price: 1215,
  },
  {
    id: 6,
    image_url: "/products/chimp.png",
    title:"товар 6",
    description:"Описание описание описание описание описание. ауццау, описание  fe описание. fefe.ауц ау цуацау ццау цуа ацу ацу ауцацууцаауц ауц",
    price: 1215,
  }
];

module.exports = {
  reviews,
  cartItems,
  products,
};
